; domain
(define (domain ferry)
  (:requirements :strips :constraints :negative-preconditions)
   (:predicates (not-eq ?v1 ?v6)
		(pred_4 ?v8)
		(pred_5 ?v7)
		(pred_2 ?v7)
		(pred_1 ?v8 ?v7)
		(pred_3)
		(pred_6 ?v8))

   (:action op_2
       :parameters  (?v3 ?v2)
       :precondition (and (not-eq ?v3 ?v2) 
                          (pred_5 ?v3) (pred_5 ?v2) (pred_2 ?v3))
       :effect (and  (pred_2 ?v2)
		     (not (pred_2 ?v3))))


   (:action op_3
       :parameters (?v5 ?v4)
       :precondition  (and  (pred_4 ?v5) (pred_5 ?v4)
			    (pred_1 ?v5 ?v4) (pred_2 ?v4) (pred_3))
       :effect (and (pred_6 ?v5)
		    (not (pred_1 ?v5 ?v4)) 
		    (not (pred_3))))

   (:action op_1
       :parameters  (?v5  ?v4)
       :precondition  (and  (pred_4 ?v5) (pred_5 ?v4)
			    (pred_6 ?v5) (pred_2 ?v4))
       :effect (and (pred_1 ?v5 ?v4)
		    (pred_3)
		    (not (pred_6 ?v5)))))

; problem
(define (problem ferry-l3-c3)
(:domain ferry)
(:objects obj_06 obj_05 obj_03 
          obj_01 obj_02 obj_04 
)
(:init
(pred_5 obj_06)
(pred_5 obj_05)
(pred_5 obj_03)
(pred_4 obj_01)
(pred_4 obj_02)
(pred_4 obj_04)
(not-eq obj_06 obj_05)
(not-eq obj_05 obj_06)
(not-eq obj_06 obj_03)
(not-eq obj_03 obj_06)
(not-eq obj_05 obj_03)
(not-eq obj_03 obj_05)
(pred_3)
(pred_1 obj_01 obj_03)
(pred_1 obj_02 obj_05)
(pred_1 obj_04 obj_05)
(pred_2 obj_03)
)
(:goal
(and
(pred_1 obj_01 obj_06)
(pred_1 obj_02 obj_03)
(pred_1 obj_04 obj_05)
)
)

(:constraints
  (and
    (sometime-before  (pred_1 obj_01 obj_06) (pred_2 obj_05))
    (sometime-before  (pred_1 obj_02 obj_03) (pred_2 obj_06))
  )
)
)

; plan
1. (op_3 obj_01 obj_03)
   deleted: (pred_1 obj_01 obj_03) (pred_3)
   added: (pred_6 obj_01)
   goals met: 1 of 3
2. (op_2 obj_03 obj_05)
   deleted: (pred_2 obj_03)
   added: (pred_2 obj_05)
   goals met: 1 of 3
3. (op_1 obj_01 obj_05)
   deleted: (pred_6 obj_01)
   added: (pred_1 obj_01 obj_05) (pred_3)
   goals met: 1 of 3
4. (op_3 obj_02 obj_05)
   deleted: (pred_1 obj_02 obj_05) (pred_3)
   added: (pred_6 obj_02)
   goals met: 1 of 3
5. (op_2 obj_05 obj_06)
   deleted: (pred_2 obj_05)
   added: (pred_2 obj_06)
   goals met: 1 of 3
6. (op_1 obj_02 obj_06)
   deleted: (pred_6 obj_02)
   added: (pred_1 obj_02 obj_06) (pred_3)
   goals met: 1 of 3
7. (op_2 obj_06 obj_05)
   deleted: (pred_2 obj_06)
   added: (pred_2 obj_05)
   goals met: 1 of 3
8. (op_3 obj_01 obj_05)
   deleted: (pred_1 obj_01 obj_05) (pred_3)
   added: (pred_6 obj_01)
   goals met: 1 of 3
9. (op_2 obj_05 obj_06)
   deleted: (pred_2 obj_05)
   added: (pred_2 obj_06)
   goals met: 1 of 3
10. (op_1 obj_01 obj_06)
   deleted: (pred_6 obj_01)
   added: (pred_1 obj_01 obj_06) (pred_3)
   goals met: 2 of 3
11. (op_3 obj_02 obj_06)
   deleted: (pred_1 obj_02 obj_06) (pred_3)
   added: (pred_6 obj_02)
   goals met: 2 of 3
12. (op_2 obj_06 obj_03)
   deleted: (pred_2 obj_06)
   added: (pred_2 obj_03)
   goals met: 2 of 3
13. (op_1 obj_02 obj_03)
   deleted: (pred_6 obj_02)
   added: (pred_1 obj_02 obj_03) (pred_3)
   goals met: 3 of 3
